---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElementFailures.NotAllowedToRemoveAllElements
source: html/381e3cac-eaa2-c3ce-122f-fc10e57b8a91.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElementFailures.NotAllowedToRemoveAllElements Property

You cannot removed all the elements from current solution. At least there should be two elements in the solution.

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllowedToRemoveAllElements { get; }
```